locations_count = int(input())

for location in range(1, locations_count + 1):
    total_income = 0
    expected_income_per_day = int(input())
    working_days = int(input())
    for days in range(1, working_days + 1):
        income = int(input())
        total_income += income
    average_total_income = total_income / working_days
    if average_total_income >= expected_income_per_day:
        print(f"Good job! Average gold per day: {average_total_income:.2f}.")
    else:
        diff = expected_income_per_day - average_total_income
        print(f"You need {diff:.2f} gold.")
        
        
# ------------------------------------- Problem to resolve ------------------------------
#
# Група ентусиасти обикалят по различни локации, където има златни мини. Вашата задача е да им помогнете като
# напишете програма, която да приема броя на локациите и очакван среден добив на злато за ден за една локация.
# За всеки ден ще получавате колко злато са добили на локацията. Проверете дали са постигнали очаквания добив
# за дадена локация или не.
# Вход:
# Първоначално от конзолата се прочита едно число – брой локации – цяло число в интервала [1.. 100]
# За всяка една локация се четат две числа, по едно на ред:
# На първия ред – очакван среден добив на ден злато – реално число в интервала [0.00.. 10000.00]
# На втория ред – брой дни, в който ще се копае на дадената локация – цяло число в интервала [1.. 30]
# За всеки ден се чете по едно число:
# Добито злато за деня – реално число в интервала [0.00.. 1000.00]
# Изход:
# След приключване на копаенето на дадена локация се печата един ред според случая:
# Ако средният добив злато за ден достига или надвишава очаквания среден добив на ден злато:
# "Good job! Average gold per day: {среден добив на ден за дадената локация}."
# Ако средният добив злато за ден е под очаквания среден добив на ден злато:
# "You need {злато, което не е достигнало за достигане на очакваният среден добив} gold."
# Резултатът да бъде форматиран до вторият знак след десетичният разделител.
# -------------------------------------- Example inputs ----------------------------------
# Вход	                        Изход
# 2                             Good job! Average gold per day: 10.33.
# 10                            You need 5.00 gold.
# 3
# 10
# 10
# 11
# 20
# 2
# 20
# 10
# ----------------------------------------------------------------------
# 1                             You need 0.33 gold.
# 5
# 3
# 10
# 1
# 3
