x1 = int(input())
x2 = int(input())
x3 = int(input())

for i in range(2, x1+1, 2):
    for j in range(2, x2+1):
        for k in range(2, x3+1, 2):
            if j == 2 or j == 3 or j == 5 or j == 7:
                print(f"{i} {j} {k}")

#Да се напише програма, която генерира трицифрени PIN кодове, като цифрите на всеки PIN код са в определен интервал. 
#За да бъде валиден един PIN код той трябва да отговаря на следните условия:
#Първата и третата цифра трябва да бъдат четни.
#Втората цифра трябва да бъде просто число в диапазона [2...7].
#Вход
#От конзолата се четат 3 реда:
#Горната граница на първото число - цяло число в диапазона [1...9]
#Горната граница на второто число - цяло число в диапазона [1...9]
#Горната граница на третото число - цяло число в диапазона [1...9]
#Изход
#Да се отпечатат на конзолата всички валидни трицифрени PIN кодове, чиито цифри отговарят на съответните интервали.
#Вход                      Изход
#3                         2 2 2
#5                         2 2 4
#5                         2 3 2
#                          2 3 4
#                          2 5 2
#                          2 5 4
#--------------------------------------
#8                         2 2 2
#2                         2 2 4
#8                         2 2 6
#                          2 2 8
#                          4 2 2
#                          4 2 4
#                          4 2 6
#                          4 2 8
#                          6 2 2
#                          6 2 4
#                          6 2 6
#                          6 2 8
#                          8 2 2
#                          8 2 4
#                          8 2 6
#                          8 2 8
