start_interval = int(input())
end_interval = int(input())

for i in range(start_interval, end_interval + 1):
    for j in range(start_interval, end_interval + 1):
        for k in range(start_interval, end_interval + 1):
            for n in range(start_interval, end_interval + 1):
                middle_sum = j + k
                if i > n and i % 2 != 0 and n % 2 == 0 and middle_sum % 2 == 0:
                    print(f"{i}{j}{k}{n}", end=" ")
                elif i > n and i % 2 == 0 and n % 2 != 0 and middle_sum % 2 == 0:
                    print(f"{i}{j}{k}{n}", end=" ")

#Поздравления, поради вашите задълбочени знания в сферата на програмирането МВР реши да наеме 
#точно вас за създаването на новата им система за генериране на специални автомобилни номера. 
#Всеки един специален автомобилен номер се състой от четири числа. Условията, които разграничават 
#специалните от обикновените номера са следните: 
#Ако номерът започва с четна цифра, то той трябва да завършва на нечетна цифра и обратното – 
#ако започва с нечетна,  завършва на четна
#Първата цифра от номера е по-голяма от последната
#Сумата от втората и третата цифра трябва да е четно число
#Входа се състой от две числа - начало и край на интервал, между които трябва да се генерира всяко едно число от номера.
#Вход
#Първи ред - едноцифрено число - началото на интервала – цяло число в интервала [1…9]
#Втори ред - едноцифрено число - края на интервала – цяло число в интервала [1…9]
#Изход
#На конзолата трябва да се отпечатат всички специални номера, разделени с интервал.
#Вход                           Изход
#2                              3222 3332                
#3
#-----------------------------------------------
#3                              4333 4353 4443 4533 4553 5334 5354 5444 5534 5554
#5
