men_count = int(input())
women_count = int(input())
tables_count = int(input())
total_tables = 0
is_full = False

for man in range(1, men_count + 1):
    for woman in range(1, women_count + 1):
        total_tables += 1
        print(f"({man} <-> {woman})", end=" ")
        if total_tables == tables_count:
            is_full = True
            break
    if is_full:
        break

#Провокирани от сватбата си, Михаела и Иван решават да предоставят нова услуга на клиенти на ресторанта си, 
#а именно вечеря за запознанства - "Предизвикай Сватбата". Напишете програма, която отпечатва всички 
#възможни срещи на клиентите на ресторанта. При настаняване всеки мъж и всяка жена получават талончета
#с поредни номера стартирайки от 1. Ако бъдат заети всички маси, програмата трябва да приключи. 
#Всяка маса има две места.

#От конзолата се четат точно 3 числа, всяко на отделен ред:
#Броя клиенти мъже - цяло число в интервала [1...100]
#Броя клиенти жени - цяло число в интервала [1...100]
#Максималният брой маси - цяло число в интервала [1...100]
#Изход
#На конзолата се принтират на един ред, разделени с интервал всички срещи в следният формат:
#           ({№ клиент} <-> {№ клиент}) ({№ клиент} <-> {№ клиент}) ...
#Вход                       Изход
#2                          (1 <-> 1) (1 <-> 2) (2 <-> 1) (2 <-> 2)
#2
#6
#----------------------------------------------------------------------
#2                          (1 <-> 1) (1 <-> 2) (2 <-> 1) 
#2
#3
