first_sector = "A"
last_sector = input()
first_sector_rows_count = int(input())
odd_places_count = int(input())
total = 0

for sector in range(ord(f"{first_sector}"), ord(f"{last_sector}") + 1):
    for row in range(1, first_sector_rows_count + 1):
        current_places = odd_places_count
        if row % 2 == 0:
            current_places += 2
        for place in range(1, current_places + 1):
            place_alphabetical = chr(place + 96)
            total += 1
            print(f"{chr(sector)}{row}{place_alphabetical}")
    first_sector_rows_count += 1
print(total)

#Младоженците искат да направят списък кой на кое място ще седи на сватбената церемония. 
#Местата са разделени на различни сектори. Секторите са главните латински букви като започват от A. 
#Във всеки сектор има определен брой редове. От конзолата се чете броят на редовете в първия сектор (A), 
#като във всеки следващ сектор редовете се увеличават с 1. На всеки ред има определен брой места - 
#тяхната номерация е представена с малките латински букви. Броя на местата на нечетните редове се прочита от конзолата, 
#а на четните редове местата са с 2 повече.
#Вход
#От конзолата се четaт 3 реда:
#Последния сектор от секторите - символ (B-Z)
#Броят на редовете в първия сектор - цяло число (1-100)
#Броят на местата на нечетен ред - цяло число (1-24)
#Изход
#Да се отпечата на конзолата всяко място на отделен ред по следния формат:
#{сектор}{ред}{място}
#Накрая трябва да отпечата броя на всички места.
#Вход                    Изход
#B                       A1a
#3                       A1b
#2                       A2a
#                        A2b
#                        A2c
#                        A2d
#                        A3a
#                        A3b
#                        B1a
#                        B1b
#                        B2a
#                        B2b
#                        B2c
#                        B2d
#                        B3a
#                        B3b
#                        B4a
#                        B4b
#                        B4c
#                        B4d
#                        20
