a = int(input())
b = int(input())

max_passwords = int(input())
total = 0

i = 35
j = 64

for k in range(1, a + 1):
    for n in range(1, b + 1):
        total += 1
        print(f"{chr(i)}{chr(j)}{k}{n}{chr(j)}{chr(i)}", end="|")
        if total == max_passwords:
            break
        i += 1
        j += 1
    if total == max_passwords:
        break
      
#Ани се страхува от това, да не й бъде хакнат някой от профилите в социалните мрежи, 
#затова решава да направи генератор за пароли, които да бъдат достатъчно сигурни. 
#Вашата задача е да й помогнете да напише програма, която ще генерира тези пароли, 
#разделени една от друга от знака "|".
#Да се напише програма, която генерира серия от символи като в шаблона:
#                               ABxyBA 
#като при всяко генериране на нов код, стойностите на символите се увеличават с 1. 
#Ако A надхвърли 55, се връща на 35. Ако B надхвърли 96, се връща на 64.
#Вход
#От конзолата се чете 1 ред:
#На първия ред a – цяло число в интервала [1 … 1000]
#На втория ред b – цяло число в интервала [1 … 1000]
#На третия ред максимален брой генерирани пароли – цяло число в интервала [1 … 1000000]
#Ограничения:
#A е символ с ASCII стойност в диапазона [35… 55]
#B е символ с ASCII стойност в диапазона [64 … 96]
#x e цяло число в диапазона [1… a] 
#y e цяло число в диапазона [1… b] 
#Изход:
#Да се отпечата на конзолата:
#Генерираният код. Ако броят на комбинациите е по-голям от максималния на кода, 
#да се отпечата до подадената стойност, в противен случай да се отпечата до текущия брой на комбинациите.
#Вход                  Изход
#2                     #@11@#|$A12A$|%B13B%|&C21C&|'D22D'|(E23E(|
#3
#10
#--------------------------------------------------------------------
#20                    #@11@#|$A12A$|%B13B%|&C14C&|'D15D'|(E16E(|)F17F)|*G18G*|+H19H+|,I110I,|
#50
#10
