coins_1lv_count = int(input())
coins_2lv_count = int(input())
banknotes_5lv_count = int(input())
total_sum = int(input())
for i in range(0, coins_1lv_count + 1):
    for j in range(0, coins_2lv_count + 1):
        for k in range(0, banknotes_5lv_count + 1):
            if i * 1 + j * 2 + k * 5 == total_sum:
                print(f"{i} * 1 lv. + {j} * 2 lv. + {k} * 5 lv. = {total_sum} lv.")
                
#Имаме банкноти и монети по 1лв., по 2лв. и по 5лв. 
#Да се напише програма, която прочита въведените от потребителя брой банкноти и монети и сума, 
#и извежда на екран всички възможни начини по които сумата може да се изплати с наличните банкноти. 
#Вход
#Входът се чете от конзолата и съдържа точно 4 реда:
#Брой монети по 1лв. - цяло положително число; 
#Брой монети по 2лв. - цяло положително число;
#Брой банкноти по 5лв. - цяло положително число;
#Сума - цяло положително число в интервала [1…1000];
#Изход
#Да се отпечатат на конзолата всички комбинации от дадените номинали, образуващи сумата, 
#форматирани по следния начин:
#"{бр. 1лв.} * 1 lv. + {бр. 2лв.} * 2 lv. + {бр. 5лв.} * 5 lv. = {сума} lv."
#Вход               Изход
#3                  0 * 1 lv. + 0 * 2 lv. + 2 * 5 lv. = 10 lv.
#2                  1 * 1 lv. + 2 * 2 lv. + 1 * 5 lv. = 10 lv.
#3                  3 * 1 lv. + 1 * 2 lv. + 1 * 5 lv. = 10 lv.
#10
#---------------------------------------------------------------
#5                  0 * 1 lv. + 1 * 2 lv. + 1 * 5 lv. = 7 lv.
#3                  1 * 1 lv. + 3 * 2 lv. + 0 * 5 lv. = 7 lv.
#1                  2 * 1 lv. + 0 * 2 lv. + 1 * 5 lv. = 7 lv.
#7                  3 * 1 lv. + 2 * 2 lv. + 0 * 5 lv. = 7 lv.
#                   5 * 1 lv. + 1 * 2 lv. + 0 * 5 lv. = 7 lv.
