n = int(input())
total_2 = 0
total_3 = 0
total_4 = 0

for number in range(1, n + 1):
    current_number = int(input())
    if current_number % 2 == 0:
        total_2 += 1
    if current_number % 3 == 0:
        total_3 += 1
    if current_number % 4 == 0:
        total_4 += 1
percentage_2 = total_2 / n * 100
percentage_3 = total_3 / n * 100
percentage_4 = total_4 / n * 100
print(f"{percentage_2:.2f}%")
print(f"{percentage_3:.2f}%")
print(f"{percentage_4:.2f}%")

#Вход
#На първия ред от входа стои цялото число n (1 ≤ n ≤ 1000) – брой числа. 
#На следващите n-на брой реда стои по едно цяло число в интервала [1…1000] – 
#числата които да бъдат проверени на колко се делят.
#Изход
#Да се отпечатат на конзолата 3 реда, всеки от които съдържа процент между 0% и 100%, 
#с точност две цифри след десетичната точка, например 25.00%, 66.67%, 57.14%.
#   На първият ред – процентът на числата които се делят на 2
#   На вторият ред – процентът на числата които се делят на 3
#   На третият ред – процентът на числата които се делят на 4
#Вход                     Изход
#3                        33.33%
#3                        100.00%
#6                        0.00%
#9
