number_sum = int(input())

for i in range(1, 10):
    for j in range(1, 10):
        for k in range(1, 10):
            for n in range(1, 10):
                number_sum1 = i + j
                number_sum2 = k + n
                if number_sum > 9:
                    if number_sum % number_sum1 == 0 and number_sum1 == number_sum2:
                        print(f"{i}{j}{k}{n}", end=" ")
                else:
                    if number_sum == number_sum1 and number_sum == number_sum2:
                        print(f"{i}{j}{k}{n}", end=" ")
#Да се напише програма, която прочита едно цяло число N и генерира всички възможни "щастливи" и 
#различни 4-цифрени числа(всяка цифра от числото е в интервала [1...9]). 
#Числото трябва да отговаря на следните условия: 
#Щастливо число е 4-цифрено число, на което сбора от първите две цифри е равен на сбора от последните две. 
#Числото N трябва да се дели без остатък от сбора на първите две цифри на "щастливото" число.
#Вход
#Входът се чете от конзолата и се състои от едно цяло число в интервала [2...10000]
#Изход
#На конзолата трябва да се отпечатат всички "щастливи" и различни 4-цифрени числа, разделени с интервал
#Вход                       Изход
#3                          1212 1221 2112 2121
#-----------------------------------------------
#7                          1616 1625 1634 1643 1652 1661 2516 2525 2534 2543 2552 2561 3416 3425 3434 3443 
#                           3452 3461 4316 4325 4334 4343 4352 4361 5216 5225 5234 5243 5252 5261 6116 6125 
#                           6134 6143 6152 6161
