char_1 = input()
char_2 = input()
char_3 = input()
total = 0

for alpha1 in range(ord(char_1), ord(char_2) + 1):
    for alpha2 in range(ord(char_1), ord(char_2) + 1):
        for alpha3 in range(ord(char_1), ord(char_2) + 1):
            is_valid = alpha1 != ord(char_3) and alpha2 != ord(char_3) and alpha3 != ord(char_3)
            if is_valid:
                total += 1
                print(f'{chr(alpha1)}{chr(alpha2)}{chr(alpha3)}', end=" ")
print(total)

#Напишете програма, която да принтира на конзолата всички комбинации от 3 букви в зададен интервал, 
#като се пропускат комбинациите съдържащи зададена от конзолата буква. 
#Накрая трябва да се изпринтира броят на отпечатаните комбинации.
#Вход
#Входът се чете от конзолата и съдържа точно 3 реда:
#Малка буква от английската азбука за начало на интервала – от ‘a’ до ‚z’.
#Малка буква от английската азбука за край на интервала  – от първата буква до ‚z’.
#Малка буква от английската азбука – от ‘a’ до ‚z’ – като комбинациите съдържащи тази буквата се пропускат.
#Изход
#Да се отпечатат на един ред всички комбинации отговарящи на условието плюс броят им разделени с интервал.
#Вход               Изход
#a                  aaa aac aca acc caa cac cca ccc 8
#c
#b
