number_sum = int(input())

for i in range(1, 10):
    for j in range(1, 10):
        for k in range(1, 10):
            for n in range(1, 10):
                number_sum1 = i + j
                number_sum2 = k + n
                if number_sum > 9:
                    if number_sum % number_sum1 == 0 and number_sum1 == number_sum2:
                        print(f"{i}{j}{k}{n}", end=" ")
                else:
                    if number_sum == number_sum1 and number_sum == number_sum2:
                        print(f"{i}{j}{k}{n}", end=" ")
                        
#Да се напише програма, която прочита едно цяло число N и генерира всички възможни "щастливи" 
#и различни 4-цифрени числа(всяка цифра от числото е в интервала [1...9]). 
#Числото трябва да отговаря на следните условия: 
#Щастливо число е 4-цифрено число, на което сбора от първите две цифри е равен на сбора от последните две.
#Числото N трябва да се дели без остатък от сбора на първите две цифри на "щастливото" число.
#Вход
#Входът се чете от конзолата и се състои от едно цяло число в интервала [2...10000]
#Изход
#На конзолата трябва да се отпечатат всички "щастливи" и различни 4-цифрени числа, разделени с интервал
#Вход                       Изход
#3                          1212 1221 2112 2121
#----------------------------------------------------
#24                         1111 1212 1221 1313 1322 1331 1515 1524 1533 1542 1551 1717 
#                           1726 1735 1744 1753 1762 1771 2112 2121 2213 2222 2231 2415 
#                           2424 2433 2442 2451 2617 2626 2635 2644 2653 2662 2671 3113 
#                           3122 3131 3315 3324 3333 3342 3351 3517 3526 3535 3544 3553 
#                           3562 3571 3939 3948 3957 3966 3975 3984 3993 4215 4224 4233 
#                           4242 4251 4417 4426 4435 4444 4453 4462 4471 4839 4848 4857 
#                           4866 4875 4884 4893 5115 5124 5133 5142 5151 5317 5326 5335 
#                           5344 5353 5362 5371 5739 5748 5757 5766 5775 5784 5793 6217 
#                           6226 6235 6244 6253 6262 6271 6639 6648 6657 6666 6675 6684 
#                           6693 7117 7126 7135 7144 7153 7162 7171 7539 7548 7557 7566 
#                           7575 7584 7593 8439 8448 8457 8466 8475 8484 8493 9339 9348 
#                           9357 9366 9375 9384 9393
