num = (float(input()))
number = int(100 * num)
total = 0

while number != 0:
    if number >= 200:
        number -= 200
    elif number >= 100:
        number -= 100
    elif number >= 50:
        number -= 50
    elif number >= 20:
        number -= 20
    elif number >= 10:
        number -= 10
    elif number >= 5:
        number -= 5
    elif number >= 2:
        number -= 2
    elif number >= 1:
        number -= 1
    total += 1
print(f"{total}")


# ------------------------------------- Problem to resolve ------------------------------
#
# Производителите на вендинг машини искали да направят машините си да връщат възможно най-малко монети ресто. 
# Напишете програма, която приема сума - рестото, което трябва да се върне и изчислява с колко най-малко 
# монети може да стане това.
# Вход	            Изход
# 1.23	            4	
# -------------------------
# 2	                1	
# -------------------------
# 0.56	            3
# -------------------------
# 2.73	            5
